//---------------------------------------------------------------------------

#include <vcl.h>
#include <math.h> // Підключення бібліотеки для математичних функцій
#pragma hdrstop

#include "Unit1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
// Функція f16, яка приймає один параметр k і повертає значення виразу
double f16(double k) {
    return (cos(3.4 * k) * sin(abs(-k))) / (0.3 -6.24);
}

// Функція f17, яка приймає один параметр n і повертає значення виразу
double f17(double n) {
    return abs(cos(2 * pow(n, 3)) + sin(14 * n -3)) + 2.44;
}
//---------------------------------------------------------------------------
void __fastcall TForm1::BtnCalcClick(TObject *Sender)
{
	Memo1->Clear();
	// Оголошення двовимірного масиву
    double A[4][4];
    double sum = 0; // Змінна для зберігання суми квадратів
    int moreThanCount = 0; // Змінна для зберігання суми квадратів

//    std::cout << "Елементи, які більші ніж 2: ";

    // Перебір рядків
    for (int k = 1; k <= 4; k++) {
        // Перебір стовпців
        for (int n = 1; n <= 4; n++) {
            // Обчислення значення елемента матриці за заданою формулою
			A[k-1][n-1] = n * f16(k) + sin(k) * f17(n);
			StringGrid1->Cells[k-1][n-1]=A[k-1][n-1];

            // Перевірка, чи елемент більший ніж 2
			if (A[k-1][n-1] > 2) {
                moreThanCount++;

                // Додавання квадрата елемента до суми
                sum += pow(A[k-1][n-1], 2);
            }
		}
    }

    // Виведення суми квадратів елементів більших ніж 2
    if (moreThanCount == 0) {
		Memo1->Lines->Add("No elements");
    } else {
		Memo1->Lines->Add("The sum of the squares of the elements is greater than 2: " + FloatToStr(sum));
	}
}
//---------------------------------------------------------------------------
