#include <iostream> // Підключення бібліотеки для вводу/виводу даних
#include <cmath> // Підключення бібліотеки для математичних функцій

int main() {
    // Оголошення матриці розміром 4x4 та змінної для суми квадратів
    double A[4][4]; // Матриця для зберігання значень
    double sum = 0; // Змінна для зберігання суми квадратів

    // Виведення заголовка для елементів більших ніж 2
    std::cout << "Елементи, які більші ніж 2: " << std::endl;

    // Перебір рядків
    for (int k = 1; k <= 4; k++) {
        // Перебір стовпців
        for (int n = 1; n <= 4; n++) {
            // Обчислення значення елемента матриці за заданою формулою
            A[k-1][n-1] = n * (cos(3.4 * k) * sin(abs(-k) / 0.3 - 6.24)) + sin(k) * (abs(cos(2 * pow(n, 3)) + sin(14 * n - 3)) + 2.44);

            // Перевірка, чи елемент більший ніж 2
            if (A[k-1][n-1] > 2) {
                // Виведення індексів та значення елемента
                std::cout << "Елемент[" << k << "][" << n << "]: " << A[k-1][n-1] << std::endl;

                // Додавання квадрата елемента до суми
                sum += pow(A[k-1][n-1], 2);
            }
        }
    }

    // Виведення суми квадратів елементів більших ніж 2
    std::cout << "Сума квадратів елементів більших ніж 2: " << sum << std::endl;

    return 0;
}
