class Спадок:
    def __init__(self, номінал_монет, кількість_монет):
        self.номінал_монет = номінал_монет
        self.кількість_монет = кількість_монет

    def обчислити_суму(self):
        return self.номінал_монет * self.кількість_монет

    def обчислити_вартість(self, курс):
        return self.обчислити_суму() * курс

    def __str__(self):
        return f"Спадок: {self.кількість_монет} монет номіналом {self.номінал_монет}"

# Приклад використання класу
номінал_монети = 10  # Номінал коштовних монет
кількість_монет = 5  # Кількість монет

спадок_обєкт = Спадок(номінал_монети, кількість_монет)

# Вивід інформації про об'єкт
print(str("спадок_об'єкт"))

# Обчислення суми спадку
сума_монет = спадок_обєкт.обчислити_суму()
print(f"Сума спадку в коштовних монетах: {сума_монет}")

# Обчислення вартості спадку з використанням курсу обміну
курс_обміну = 30  # Припустимий курс обміну
вартість_грн = спадок_обєкт.обчислити_вартість(курс_обміну)
print(f"Вартість спадку в гривнях: {вартість_грн} грн")
