#include <iostream> // Підключення бібліотеки для вводу/виводу даних
#include <cmath> // Підключення бібліотеки для математичних функцій

// Функція f16, яка приймає один параметр k і повертає значення виразу
double f16(double k) {
    return (cos(3.4 * k) * sin(abs(-k))) / (0.3 -6.24);
}

// Функція f17, яка приймає один параметр n і повертає значення виразу
double f17(double n) {
    return abs(cos(2 * pow(n, 3)) + sin(14 * n -3)) + 2.44;
}

int main() {
    // Оголошення двовимірного масиву
    double A[4][4];
    double sum = 0; // Змінна для зберігання суми квадратів
    int moreThanCount = 0; // Змінна для зберігання суми квадратів

    std::cout << "Елементи, які більші ніж 2: " << std::endl;

    // Перебір рядків
    for (int k = 1; k <= 4; k++) {
        // Перебір стовпців
        for (int n = 1; n <= 4; n++) {
            // Обчислення значення елемента матриці за заданою формулою
            A[k-1][n-1] = n * f16(k) + sin(k) * f17(n);

            // Перевірка, чи елемент більший ніж 2
            if (A[k-1][n-1] > 2) {
                // Виведення індексів та значення елемента
                std::cout << "Елемент[" << k << "][" << n << "]: " << A[k-1][n-1] << std::endl;
                moreThanCount++;

                // Додавання квадрата елемента до суми
                sum += pow(A[k-1][n-1], 2);
            }
        }
    }

    // Виведення суми квадратів елементів більших ніж 2
    if (moreThanCount == 0) {
        std::cout << "Елементи відсутні" << std::endl;
    } else {
            std::cout << "Сума квадратів елементів більших ніж 2: " << sum << std::endl;
    }

    return 0;
}
