def sqrt_nth_root(a, epsilon, n):
    # Початкове наближене значення кореня
    X = a / n
    
    # перевірка чи введено правильні дані
    if epsilon < 1 and a > 0:
        # Обчислення кореня з точністю ε
        while True:
            # Обчислення наступного наближеного значення кореня
            X_next = (1/n) * ((n-1) * X + a / (X ** (n-1)))
            
            # Перевірка умови завершення
            if abs(X_next - X) < epsilon:
                return X_next
            
            # Оновлення поточного наближеного значення
            X = X_next
    else:
        return "Точність ε більше за 1 або число а менше 0"

# Введення значень a, ε та n з клавіатури
a = float(input("Введіть число a: "))
epsilon = float(input("Введіть точність ε (менше 1): "))
n = int(input("Введіть степінь кореня n: "))

# Виклик функції та виведення результату
result = sqrt_nth_root(a, epsilon, n)
print(f"Корінь {n}-го ступеня з числа {a} з точністю {epsilon} дорівнює: {result}")