#include <iostream> // Включення бібліотеки iostream, яка дозволяє використовувати введення/виведення

// Функція для обчислення еквівалентного опору в послідовному з'єднанні
double calculateSeriesResistance(double R1, double R2) {
    return R1 + R2; // Обчислюємо суму двох опорів
}

// Функція для обчислення еквівалентного опору в паралельному з'єднанні
double calculateParallelResistance(double R1, double R2) {
    return 1 / (1 / R1 + 1 / R2); // Обчислюємо обернену величину суми обернених опорів
}

int main() {
    double R1, R2; // Оголошення змінних для опорів
    int choice; // Оголошення змінної для вибору операції

    std::cout << "Введіть значення опору R1: "; // Вивід повідомлення для введення опору R1
    std::cin >> R1; // Зчитування значення опору R1 з консолі
    std::cout << "Введіть значення опору R2: "; // Вивід повідомлення для введення опору R2
    std::cin >> R2; // Зчитування значення опору R2 з консолі

    while (true) {
        std::cout << "Оберіть операцію:\n"; // Вивід меню операцій
        std::cout << "1. Обчислити еквівалентний опір в послідовному з'єднанні\n";
        std::cout << "2. Обчислити еквівалентний опір в паралельному з'єднанні\n";
        std::cout << "Ваш вибір: "; // Вивід повідомлення для вибору операції
        std::cin >> choice; // Зчитування вибору користувача з консолі

        if (choice == 1) { // Якщо користувач вибрав операцію 1
            double equivalentResistance = calculateSeriesResistance(R1, R2); // Обчислення еквівалентного опору в послідовному з'єднанні
            std::cout << "Еквівалентний опір в послідовному з'єднанні: " << equivalentResistance << " Ом\n"; // Вивід результату
            break; // Вихід із циклу
        } else if (choice == 2) { // Якщо користувач вибрав операцію 2
            double equivalentResistance = calculateParallelResistance(R1, R2); // Обчислення еквівалентного опору в паралельному з'єднанні
            std::cout << "Еквівалентний опір в паралельному з'єднанні: " << equivalentResistance << " Ом\n"; // Вивід результату
            break; // Вихід із циклу
        } else {
            std::cout << "Некоректний вибір. Спробуйте ще раз.\n"; // Вивід повідомлення про некоректний вибір
        }
    }

    return 0; // Завершення програми з кодом повернення 0
}
