# Імпорт модуля math для доступу до математичних функцій
import math

# 2. За допомогою команди input - користувача вводить значення для змінних A, B та C
a = float(input("Введіть значення a: "))
b = float(input("Введіть значення b: "))
c = float(input("Введіть значення c: "))

# Розраховуємо перший вираз
# math.sqrt - корінь квадратний
# ** - піднесення до квадрату
expression_1 = math.sqrt(a**3 + c**3) - b

# Розраховуємо другий вираз
# math.sin - функція для розрахунку синуса
expression_2 = math.sqrt(c - a**3) + math.sin(b)

# Виводимо результати черезf-рядки, %.7f - для визначення кількості цифр після коми
print(f"Результат розрахунку першого виразу = {expression_1:.7f}")
print(f"Результат розрахунку другого виразу = {expression_2:.1f}")