# Отримання числа від користувача
num = int(input("Введіть чотиризначне число: "))

# Отримання кожної цифри числа

# цифра тисячного розряду, отримана шляхом цілочисельного ділення числа на 1000.
digit1 = num // 1000

# цифра сотого розряду, отримана спочатку отриманням залишку при діленні числа на 1000,
# а потім цілочисельним діленням цього на 100.
digit2 = (num % 1000) // 100

# цифра десяткового розряду, отримана спочатку отриманням залишку при діленні числа на 100
# , а потім цілочисельним діленням цього на 10.
digit3 = (num % 100) // 10

# цифра одиничного розряду, отримана шляхом отримання 
# залишку при діленні числа на 10
digit4 = num % 10

# Обчислення суми цифр
sum_of_digits = digit1 + digit2 + digit3 + digit4

# Виведення результату
print("Сума цифр числа:", sum_of_digits)