#include <iostream>

using namespace std;

// Функція, яка обчислює значення функції для заданого аргументу x
double f(double x) {
    return 4.31 + pow(cos(x), 2) * sin(2 * x - 2);
}

int main() {
    // Оголошення змінних для введення користувача
    double x_start, x_end, dx;

    // Введення початкового значення x
    cout << "Введіть x початкове (0 <= x <= 1): ";
    cin >> x_start;

    // Введення кінцевого значення x
    cout << "Введіть x кінцеве (0 <= x <= 1): ";
    cin >> x_end;

    // Введення кроку dx
    cout << "Введіть крок dx: ";
    cin >> dx;

    // Ініціалізація змінних для обчислення суми та кількості додатних значень
    double x = x_start;
    int count = 0;
    double sum = 0;

    // Виведення заголовка для таблиці
    cout << "x - аргумент" << "y - значення функції" << endl;

    // Цикл для обчислення та виведення значень функції
    while (x <= x_end) {
        double y = f(x);
        // Перевірка, чи значення функції додатнє
        if (y > 0) {
            count++;  // Якщо так, збільшити лічильник
            sum += y;  // Додати значення до суми
        }
        // Виведення значень x та y
        cout << "x = " << x << " y = " << y << endl;
        // Збільшення значення x на крок dx
        x += dx;
    }

    // Виведення суми та кількості додатних значень функції
    cout << "Сума додатних значень функції: " << sum << endl;
    cout << "Кількість додатних значень функції: " << count << endl;

    return 0;
}
