#include <iostream>

using namespace std; // Використовуємо простір імен std (стандартна бібліотека C++) для спрощення роботи з об'єктами cin та cout.

int main() { // Початок функції main, яка є вхідною точкою програми.
    double startValue = 1.0; // Ініціалізація змінної startValue, що є початковим значенням стандарти.
    double stepSize = 1.0; // Ініціалізація змінної stepSize, що є кроком зміни стандартів.
    int rowCount = 10; // Ініціалізація змінної rowCount, що є кількістю рядків таблиці.
    cout << "Введіть початкове значення стандарти: "; // Виводимо запит користувачеві на введення початкового значення стандарти.
    cin >> startValue; // Зчитування та збереження в змінній startValue введеного користувачем значення.
    cout << "Введіть крок зміни: "; // Виводимо запит користувачеві на введення кроку зміни стандартів.
    cin >> stepSize; // Зчитування та збереження в змінній stepSize введеного користувачем значення.
    cout << "Введіть кількість рядків таблиці: "; // Виводимо запит користувачеві на введення кількості рядків таблиці.
    cin >> rowCount; // Зчитування та збереження в змінній rowCount введеного користувачем значення.
    cout << "|  Стандарти  |      Роди      |  Куб. м  |" << endl; // Виведення заголовка таблиці.
    cout << "------------------------------------------------" << endl; // Виведення розділювальної лінії для таблиці.
    for (int i = 0; i < rowCount; i++) { // Початок циклу, який створює рядки таблиці.
        double standard = startValue + i * stepSize; // Обчислення значення стандарту.
        double roda = standard * 0.165; // Обчислення значення роди.
        double cubicMeter = standard * 4.672; // Обчислення значення кубічних метрів.
        cout << standard << "                  " << roda << "       " << cubicMeter << endl; // Виведення значень стандарту, род та кубічних метрів.
    }
    return 0;
}
