# Задайте діаметр колоди та ширину бруса
diameter_of_log = float(input("Введіть діаметр колоди: "))
width_of_beam = float(input("Введіть ширину бруса: "))

# Перевірка можливості випиляти брус
if width_of_beam <= diameter_of_log:
    print("Можливо випилити квадратний брус.")
else:
    print("Неможливо випилити квадратний брус: ширина бруса перевищує діаметр колоди.")
