# Введення значення сторони A, B, C
A = int(input("A: "))
B = int(input("B: "))
C = int(input("C: "))

# Введення значення сторони m, k
M = int(input("m: "))
K = int(input("k: "))

# Обчислення добутку сторін A, B, C
productABC = A * B * c

# Обчислення добутку сторін m, k
productMK = M * K

# Перевірка, чи коробка зі сторонами A, B, C пройде в двірний отвір розміром M, K
if productABC <= productMK:
    print(f"Коробка зі сторонами A({A}), B({B}), C({C}) пройде в двірний отвір розміром M({m}), K({k}).")
else:
    print(f"Коробка зі сторонами A({A}), B({B}), C({C}) НЕ пройде в двірний отвір розміром M({m}), K({k}).")
